import { OpenAPIRoute, contentJson } from "chanfana";
import { z } from "zod";

export class V1BulletinListTop extends OpenAPIRoute {
    public schema = {
        tags: ["V1BulletinListTop"],
        summary: "V1BulletinListTop",
        operationId: "V1BulletinListTop",
        request: {
            body: contentJson(
                z.object({
                    languageType: z.string(),
                })
            ),
        },
        responses: {
            "200": {
                description: "V1BulletinListTop",
                ...contentJson({
                    code: z.any(),
                    data: z.any(),
                    success: z.boolean(),
                }),
            },
        },
    };

    async handle() {
        return { "success": true, "data": [{ "id": "2017192011650473986", "sid": 15, "ti": "乒乓球賽事", "co": "2026-01-30 21:00 捷克職業聯賽 - 男子單打 (羅斯蒂斯拉夫.哈斯曼達 vs 盧卡斯.馬利克),因賽事取消，所產生在相關盤口的注單一律視為無效，串關以（1）計算。", "pt": 1769771027850 }, { "id": "2017191969517555714", "sid": 15, "ti": "乒乓球賽事", "co": "2026-01-30 19:30 捷克職業聯賽 - 男子單打 (盧卡斯.馬利克 vs 米哈伊爾.特林塔),因賽事取消，所產生在相關盤口的注單一律視為無效，串關以（1）計算。", "pt": 1769771017805 }, { "id": "2017191930959093761", "sid": 15, "ti": "乒乓球賽事", "co": "2026-01-30 20:00 捷克職業聯賽 - 男子單打 (米蘭.隆金 vs 盧卡斯.馬利克),因賽事取消，所產生在相關盤口的注單一律視為無效，串關以（1）計算。", "pt": 1769771008612 }, { "id": "2017168416446521346", "sid": 1, "ti": "足球賽事", "co": "2026-01-30 16:30 印尼冠軍聯賽 (三寶壟 vs 肯達爾龍捲風 FC)，因官方在視頻助理裁判 (VAR) 審查後判定【三寶壟】被判罰紅牌，在（GMT +8）17:09:38 - 17:11:33所產生在相關錯誤盤口的注單一律視為無效，串關以（1）計算。提前結算被取消。", "pt": 1769765402315 }, { "id": "2017164169181044738", "sid": 177, "ti": "電競足球賽事", "co": "2026-01-30 17:10 VS-FB 獨家 EAFC24 英超聯賽 (利物浦 vs 紐卡斯爾聯)，因賽事取消，除已有明確結果的注單外，所有受影響的注單一律視為無效，串關以（1）計算。", "pt": 1769764389688 }, { "id": "2017161152305123330", "sid": 1, "ti": "足球賽事", "co": "2026-01-30 16:30 印尼冠軍聯賽 (伯斯古古杜斯 vs 佩斯普拉)，因官方在視頻助理裁判 (VAR) 審查後判定進球無效，在（GMT +8）16:53:26 - 16:57:12所產生在相關錯誤盤口的注單一律視為無效，串關以（1）計算。提前結算被取消。", "pt": 1769763670408 }, { "id": "2017149118691532802", "sid": 177, "ti": "電競足球賽事", "co": "2026-01-30 16:10 VS-FB 獨家 EAFC24 英超聯賽 (伯恩利 vs 水晶宮)，因賽事取消，除已有明確結果的注單外，所有受影響的注單一律視為無效，串關以（1）計算。", "pt": 1769760801371 }, { "id": "2017146411118665729", "sid": 177, "ti": "電競足球賽事", "co": "2026-01-30 15:45 VS-FB 獨家 EAFC24 美國職業足球大聯盟 (科羅拉多急流 vs 堪薩斯城競技)，因賽事取消，除已有明確結果的注單外，所有受影響的注單一律視為無效，串關以（1）計算。", "pt": 1769760155836 }, { "id": "2017145486157193218", "sid": 47, "ti": "羽毛球賽事", "co": "2026-01-30 15:05 泰國羽毛球大師賽 - 男子單打 (李梓嘉 vs 阿爾維.法爾漢),因球員第三盤棄權，除第一盤,第二盤和已结算输赢的注单，所有受影響的注單一律視為無效，串關以（1）計算。", "pt": 1769759935308 }, { "id": "2017111631520718850", "sid": 164, "ti": "刀塔2賽事", "co": "2026-01-30 13:26 ESL中國挑戰者 (Team Refuser vs Tearlaments)，因比賽信息錯誤，除已有明確結果的注單外，所有受影響的注單一律視為無效，串關以（1）計算。", "pt": 1769751863733 }], "code": 0 };
    }
}
